var RandomQuote=function(){
var self=this;
self.quotes=[
'孔子，儒家学派创始人，成就论语，名孔丘，字仲尼，东周春秋末期鲁国人，(今山东曲阜)',
'老子，道家学派创始人，成就道德经，名李耳，字老聃dān，周朝春秋时期陈国人，(今安徽或河南)',
'孟子，儒家代表人物之一，成就孟子，名孟轲，战国时期邹国人，(今山东邹城)',
'木秀于林，风必摧之。(运命论)',
'不患无位，患所以立。不患莫己知，求为可知也。(孔子)',
'男儿徇大义，立节不沽名。(聂夷中)',
'劳心者治人，劳力者治于人。(孟子)',
'上善若水。水善利万物而不争，处众人之所恶，故几于道。(老子)',
'闻过而终礼，知耻而后勇。(礼记•中庸)',
'衰兰送客咸阳道，天若有情天亦老。(唐.李贺)。月如无恨月常圆。(宋.石延年)',
'如人以手，指月示人，彼人因指，当应看月。(楞严经)',
'凤栖梧桐 ，君子不立危墙之下。(孟子·尽心)',
'良禽择木而栖，贤臣择主而侍。(孔子)',
'良禽择木而栖，贤臣择主而事，见机不早，悔之晚矣。(三国演义)',
'士为知己者死(士为知己而搏)，女为悦己者容。(史记·刺客列传)',
'人须立志，志立则功就。天下古今之人，未有无志而建功。(朱棣)',
'应无所住，而生其心。(金刚经)',
'他强由他强，清风拂山岗；他横由他横，明月照大江；他自狠来他自恶，我自一口真气足。(倚天屠龙记)',
'祸福无门，惟人自召；善恶之报，如影随形。(太上感应篇)',
'以铜为镜可以正衣冠；以史为镜可以知兴替；以人为镜可以明得失。(旧唐书·魏徵传)',
'金玉其心，芝兰其室。仁义为友，道德为师。(唐·元希声)',
'此心不动，随即而动。(明·王阳明)',
'地不畏其低，方能聚水成海，人不畏其低，方能孚众成王。(明·洪应明·菜根谭)'];
self.getRandom=function(array){return array[Math.floor(Math.random()*(array.length))]};
self.setQuote=function(quote){var element=document.getElementById("ziyue");
if(!quote){quote=self.getRandom(self.quotes)}
if(element){element.innerHTML=quote}}
};
var rq=new RandomQuote();
rq.setQuote();